import React from 'react';
import { BrowserRouter as Router } from 'react-router-dom';
import Header from './Components/Header';
import Footer from './Components/Footer';
import Jump from './Components/MainContent/Jump';
import Note from './Components/MainContent/Note';
import Document from './Components/MainContent/Document';
import LoginForm from './Components/MainContent/LoginForm';
import RequiredDocuments from './Components/MainContent/RequiredDocuments';
import './App.css'; 

// Define the document lists and PDF links for each section
const documentsForSection1 = [
  "कन्या शिशु की नवीनतम पासपोर्ट साइज फोटो",
  "माता / पिता / अभिभावक के हस्ताक्षर",
  "स्थाई निवास प्रमाण पत्र",
  "परिवार रजिस्टर की नकल या सभासद/पार्षद द्वारा दिया गया प्रमाण पत्र",
  "राशन कार्ड की प्रति",
  "संस्थागत प्रसव का प्रमाण पत्र",
  "जन्म पंजीकरण का प्रमाण पत्र",
  "आय प्रमाण पत्र",
  "माता और पिता / अभिभावक का आधार कार्ड",
  "नगरीय / ग्रामीण स्थानीय निकाय द्वारा दिया गया गृह कर या किराया समझौते के कागजात ना उपलब्ध होने की स्तिथि में गृह कर ना देने का ग्राम प्रधान/पार्षद द्वारा प्रदत प्रमाण पत्र",
  "माता और पिता / अभिभावक का पैन कार्ड",
  "आंगनबाड़ी कार्यकर्ती द्वारा प्रदत्त प्रमाण-पत्र। ",
  "मातृशिशु प्रतिरक्षण / एम०सी० पी० (टीकाकरण) कार्ड",
  "परिवार के समस्त सदस्यों के बैंक पासबुक की प्रति एवं विगत 01 वर्ष के बैंक स्टेटमैन्ट की प्रति",
  "सामाजिक आर्थिक और जाति जनगणना (SECC) में परिवार की स्थिति के आंकलन की प्रति (यदि उपलबध है)",
  "शासनादेशानुसार योजना का लाभ केवल 02 बालिकाओं हेतु ही अनुमन्य है इसलिए आवेदित बालिका के परिवार की अन्य बालिकाओं को पूर्व में कन्या के जन्म पर योजना का लाभ दिये जाने / न दिये जाने विषयक शपथ –पत्र में निम्न बिंदु शामिल होंगे :-",
  "1. मैं प्रमाणित करता/ करती हूँ की यह लाभ मेरी प्रथम/द्वितीय पुत्री द्वारा लिया जा रहा है",
  "2. मेरे द्वारा चल अचल सम्पति एवं अन्य चाही गयी,समस्त सूचनाएं सही –सही दी गयी है",
  "3. मेरे द्वारा किसी भी तथ्य को छुपाया नहीं गया है",
  "4. मेरे द्वारा परिवार के समस्त खातो का विवरण,एक वर्ष के बैंक स्टेटमेंट सहित दे दिया गया है",
  "अन्य आवश्यक अभिलेख:-",
  "1. परिवार के विगत 03 बार के बिजली के बिलों की प्रति तथा विगत 01 बार के पानी के बिल की प्रति कनेक्शन न होने की स्तिथि में शपथ पत्र में आवश्यक रूप से उल्लेख करे।",
  "2. कोई अन्य दस्तावेज़ की प्रतिलिपि",
];

const pdfLinksForSection1 = [
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  "/Doc/born_child_aww_certificate.pdf",
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
];

const documentsForSection2 = [
  "छात्रा की नवीनतम पासपोर्ट साइज फोटो",
  "छात्रा के हस्ताक्षर",
  "माता / पिता/अभिभावक के हस्ताक्षर",
  "हाईस्कूल का प्रमाण-पत्र",
  "कक्षा 12वीं उत्तीर्ण का अंक पत्र एवं प्रमाण पत्र।",
  "या",
  "राष्ट्रीय मुक्त विद्यालय / अन्य शिक्षण संस्थान से कक्षा 12 उत्तीर्ण करने वाली आवेदिका द्वारा स्वप्रमाणित अंक पत्र की छायाप्रति",
  "छात्रा एवं माता और पिता/अभिभावक का आधार कार्ड",
  "छात्रा एवं माता और पिता/अभिभावक का पैन कार्ड",
  "छात्रा का स्थाई निवास प्रमाण पत्र",
  "नगरीय / ग्रामीण स्थानीय निकाय द्वारा दिया गया गृह कर या किराया समझौते के कागजात ना उपलब्ध होने की स्तिथि में गृह कर ना देने का ग्राम प्रधान/पार्षद द्वारा प्रदत प्रमाण पत्र",
  "आय प्रमाण पत्र",
  "परिवार रजिस्टर की नकल या सभासद/पार्षद द्वारा दिया गया प्रमाण पत्र तथा राशन कार्ड की प्रति (बालिका का नाम राशन कार्ड में अंकित होना अनिवार्य है)",
  "सामाजिक आर्थिक और जाति जनगणना में परिवार की स्थिति के आंकलन की प्रति (यदि उपलबध है)",
  "परिवार के विगत 03 बार के बिजली के बिलों की प्रति तथा विगत 01 बार के पानी के बिल की प्रति कनेक्शन न होने की स्तिथि में शपथ पत्र में आवश्यक रूप से उल्लेख करे।",
  "शासनादेशानुसार योजना का लाभ केवल 02 बालिकाओं हेतु ही अनुमन्य है इसलिए आवेदित बालिका के परिवार की अन्य बालिकाओं को पूर्व में 12वीं कक्षा पूरी करने पर योजना का लाभ दिये जाने / न दिये जाने विषयक शपथ –पत्र में निम्न बिंदु आवश्यक रूप से शामिल होंगे :-",
  "1. मैं प्रमाणित करता/ करती हूँ की यह लाभ मेरी प्रथम/द्वितीय पुत्री द्वारा लिया जा रहा है, मेरी यह पुत्री अविवाहित है।",
  "2. मेरे द्वारा चल अचल सम्पति एवं अन्य चाही गयी समस्त सूचनाएं सही –सही दी गयी है",
  "3. मेरे द्वारा किसी भी तथ्य को छुपाया नहीं गया है",
  "4. मेरे द्वारा परिवार के समस्त खातो का विवरण,एक वर्ष के बैंक स्टेटमेंट सहित दे दिया गया है",
  "लाभार्थी बालिका के बैंक पासबुक की छाया प्रति",
  "परिवार के समस्त सदस्यों के बैंक पासबुक की प्रति एवं विगत 01 वर्ष के बैंक स्टेटमैन्ट की प्रति",
  "उच्च शिक्षा में दाखिले के पूर्ण अभिलेखों की प्रति",
  "प्रधानाचार्य द्वारा कक्षा 12 उत्तीर्ण का निर्गत प्रमाण पत्र केवल संस्थागत छात्रा के लिए ",
  "या",
  "राष्ट्रीय मुक्त विद्यालय / अन्य शिक्षण संस्थान से कक्षा 12 उत्तीर्ण करने वाली आवेदिका द्वारा स्वप्रमाणित अंक पत्र की छायाप्रति",
  "या",
  "निजी विद्यालयों की छात्राओं हेतु प्रमाण पत्र (RTE के अंतर्गत पंजीकृत)",
  "आंगनबाड़ी कार्यकर्ती द्वारा प्रदत्त प्रमाण-पत्र।",
];

const  pdfLinksForSection2 = [
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  "/Doc/principle_12_certificate.pdf",
  null,
  null,
  null,
  "/Doc/12_aww_certificate_rte.pdf",
  "/Doc/12_aww_certificate.pdf"
];

const documentsForSection3 = [
  "उत्तराखण्ड राज्य में स्थापित बालिका निकेतन, नारी निकेतन, अनाथ आश्रम, उत्तराखण्ड राज्य सरकार द्वारा सहायतित अन्य गृहों में पलने वाली",
  "छात्रा की नवीनतम पासपोर्ट साइज फोटो",
  "छात्रा के हस्ताक्षर",
  "हाईस्कूल का प्रमाण-पत्र",
  "कक्षा 12वीं उत्तीर्ण का अंक पत्र एवं प्रमाण पत्र",
  "या",
  "राष्ट्रीय मुक्त विद्यालय / अन्य शिक्षण संस्थान से कक्षा 12 उत्तीर्ण करने वाली आवेदिका द्वारा स्वप्रमाणित अंक पत्र की छायाप्रति",
  "छात्रा का आधार कार्ड",
  "छात्रा का पैन कार्ड",
  "अविवाहित होने का प्रमाण पत्र (स्वयं द्वारा प्रदत्त)",
  "लाभार्थी बालिका के बैंक पासबुक की छाया प्रति",
  "प्रधानाचार्य द्वारा कक्षा 12 उत्तीर्ण का निर्गत प्रमाण पत्र केवल संस्थागत छात्रा के लिए",
  "या",
  "राष्ट्रीय मुक्त विद्यालय / अन्य शिक्षण संस्थान से कक्षा 12 उत्तीर्ण करने वाली आवेदिका द्वारा स्वप्रमाणित अंक पत्र की छायाप्रति",
  "उच्च शिक्षा में दाखिले के पूर्ण अभिलेखों की प्रति",
  "संस्था की अधीक्षिका द्वारा जारी प्रमाण-पत्र",
];

const  pdfLinksForSection3 = [
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  null,
  "/Doc/principle_12_certificate.pdf",
  null,
  null,
  null,
  "/Doc/sanstha_certificate.pdf",
];

function App() {
  return (
    <Router>
      <div className='card shadow'>
        <Header />
      </div>
      <div>
        <Jump />
        <label style={{ color: 'green', fontWeight: 700, fontSize: '16px' }}>
          <span style={{ color: 'red' }} className="blinking">Important: </span>
          नंदा गौरा योजना अंतर्गत वित्तीय वर्ष 2024-25 हेतु नए आवेदन दिनांक :30-Nov-2024 तक ही भरा जा सकता है। !!!
        </label>
      </div>
      <div className="container-fluid gradient-section-1">
        <div className="row">
          <div className="col-md-4">
            <div className="section-container">
              <Note />
            </div>
          </div>
          <div className="col-md-4">
            <div className="section-container">
              <Document />
            </div>
          </div>
          <div className="col-md-4">
            <div className="section-container">
              <LoginForm />
            </div>
          </div>
        </div>
      </div>
      <div className="container-fluid gradient-section-2">
        <div className="row">
          <RequiredDocuments title="कन्या के जन्म पर" documents={documentsForSection1} pdfLinks={pdfLinksForSection1} />
          <RequiredDocuments title="बालिका के इंटर उत्तीर्ण करने पर" documents={documentsForSection2} pdfLinks={pdfLinksForSection2} />
          <RequiredDocuments title="नारी निकेतन, अनाथ आश्रम में पलने वाली बालिका के इंटर उत्तीर्ण करने पर" documents={documentsForSection3} pdfLinks={pdfLinksForSection3} />
        </div>
      </div>
      <Footer />
    </Router>
  );
}

export default App;
